# ゲーム番号を取得する関数
def getGameNum(texts):
    gameNum = []
    for text in texts:
        for t in text:
            gameNum.append(t['gamenum'])

    return gameNum

# ゲームの合計点を取得する関数
def getTotalScores(games):
    totalScores = []
    for game in games:
        for g in game:
            totalScores.append(int(g['score']))

    return totalScores

# 1から9ピンとマークとガター、ミスの割合を取得する関数
#def getMarks(games):
def getMarks():
    games = [[{'1-1': 'gutter', '1-2': '5', '2-1': '8', '2-2': 'miss', '3-1': 'split 8', '3-2': '1', '4-1': 'strike', '4-2': 'none', '5-1': 'strike', '5-2': 'none', '6-1': '6', '6-2': 'miss', '7-1': '8', '7-2': '1', '8-1': '9', '8-2': 'spare', '9-1': '9', '9-2': 'miss', '10-1': 'strike', '10-2': '6', '10-3': 'spare', 'score': '127', 'gamenum': '1'}, {'1-1': '8', '1-2': 'spare', '2-1': '7', '2-2': 'spare', '3-1': '8', '3-2': 'miss', '4-1': '7', '4-2': 'spare', '5-1': '9', '5-2': 'miss', '6-1': 'strike', '6-2': 'none', '7-1': '7', '7-2': 'miss', '8-1': 'strike', '8-2': 'none', '9-1': '9', '9-2': 'spare', '10-1': '7', '10-2': '2', '10-3': 'none', 'score': '141', 'gamenum': '2'}, {'1-1': '7', '1-2': '1', '2-1': '8', '2-2': 'spare', '3-1': '8', '3-2': 'spare', '4-1': '9', '4-2': 'miss', '5-1': '9', '5-2': 'spare', '6-1': '9', '6-2': 'spare', '7-1': 'split 6', '7-2': 'miss', '8-1': 'strike', '8-2': 'none', '9-1': '9', '9-2': 'spare', '10-1': 'strike', '10-2': '9', '10-3': 'miss', 'score': '154', 'gamenum': '3'}, {'1-1': 'strike', '1-2': 'none', '2-1': '9', '2-2': 'spare', '3-1': 'strike', '3-2': 'none', '4-1': 'split 8', '4-2': '1', '5-1': 'strike', '5-2': 'none', '6-1': '6', '6-2': 'spare', '7-1': 'strike', '7-2': 'none', '8-1': 'strike', '8-2': 'none', '9-1': 'strike', '9-2': 'none', '10-1': '7', '10-2': 'spare', '10-3': '5', 'score': '200', 'gamenum': '4'}, {'1-1': 'strike', '1-2': 'none', '2-1': '9', '2-2': 'spare', '3-1': '8', '3-2': 'spare', '4-1': '8', '4-2': 'miss', '5-1': '7', '5-2': '2', '6-1': 'split 8', '6-2': '1', '7-1': '6', '7-2': 'miss', '8-1': 'strike', '8-2': 'none', '9-1': 'strike', '9-2': 'none', '10-1': '9', '10-2': 'miss', '10-3': 'none', 'score': '145', 'gamenum': '5'}, {'1-1': '8', '1-2': 'spare', '2-1': '7', '2-2': 'spare', '3-1': '8', '3-2': '1', '4-1': 'split 8', '4-2': 'miss', '5-1': '9', '5-2': 'miss', '6-1': '8', '6-2': 'miss', '7-1': '9', '7-2': 'spare', '8-1': '6', '8-2': '3', '9-1': '9', '9-2': 'spare', '10-1': '9', '10-2': 'spare', '10-3': 'strike', 'score': '133', 'gamenum': '6'}], [{'1-1': '9', '1-2': 'miss', '2-1': 'split 8', '2-2': 'spare', '3-1': 'strike', '3-2': 'none', '4-1': 'strike', '4-2': 'none', '5-1': '8', '5-2': 'spare', '6-1': '7', '6-2': 'spare', '7-1': '8', '7-2': 'spare', '8-1': 'strike', '8-2': 'none', '9-1': 'strike', '9-2': 'none', '10-1': 'strike', '10-2': '7', '10-3': 'miss', 'score': '199', 'gamenum': '10'}, {'1-1': 'strike', '1-2': 'none', '2-1': '7', '2-2': 'spare', '3-1': '8', '3-2': 'spare', '4-1': '9', '4-2': 'spare', '5-1': '7', '5-2': 'spare', '6-1': 'strike', '6-2': 'none', '7-1': '6', '7-2': '3', '8-1': '9', '8-2': 'spare', '9-1': 'split 8', '9-2': 'miss', '10-1': '8', '10-2': 'miss', '10-3': 'none', 'score': '156', 'gamenum': '11'}, {'1-1': '9', '1-2': 'miss', '2-1': '9', '2-2': 'miss', '3-1': 'split 7', '3-2': 'miss', '4-1': '8', '4-2': 'miss', '5-1': '8', '5-2': '1', '6-1': '9', '6-2': 'miss', '7-1': '9', '7-2': 'spare', '8-1': '9', '8-2': 'spare', '9-1': '9', '9-2': 'spare', '10-1': 'strike', '10-2': '9', '10-3': 'miss', 'score': '128', 'gamenum': '12'}, {'1-1': '7', '1-2': '2', '2-1': '8', '2-2': 'spare', '3-1': 'strike', '3-2': 'none', '4-1': '7', '4-2': 'spare', '5-1': 'strike', '5-2': 'none', '6-1': '7', '6-2': 'spare', '7-1': 'strike', '7-2': 'none', '8-1': '9', '8-2': 'spare', '9-1': '8', '9-2': 'spare', '10-1': '9', '10-2': 'spare', '10-3': '9', 'score': '185', 'gamenum': '7'}, {'1-1': 'strike', '1-2': 'none', '2-1': 'strike', '2-2': 'none', '3-1': '8', '3-2': 'spare', '4-1': '5', '4-2': '4', '5-1': '6', '5-2': 'spare', '6-1': '9', '6-2': 'spare', '7-1': '8', '7-2': '1', '8-1': 'split 6', '8-2': 'miss', '9-1': '7', '9-2': '1', '10-1': '8', '10-2': 'spare', '10-3': '9', 'score': '151', 'gamenum': '8'}, {'1-1': 'strike', '1-2': 'none', '2-1': 'strike', '2-2': 'none', '3-1': 'strike', '3-2': 'none', '4-1': 'strike', '4-2': 'none', '5-1': '8', '5-2': 'miss', '6-1': '9', '6-2': 'miss', '7-1': '8', '7-2': 'spare', '8-1': 'strike', '8-2': 'none', '9-1': 'strike', '9-2': 'none', '10-1': 'strike', '10-2': '9', '10-3': 'miss', 'score': '212', 'gamenum': '9'}]]

    print(games)
    print(games[0])
    print(type(games[0]))
    print(games[0][0])
    print(type(games[0][0]))

#getMarks()